Table of Contents
 Class NumberGroups
Namespace
IdeaRS.OpenModel.Parameters
Assembly
IdeaRS.OpenModel.dll
Defines used input of groups of numbers.
public sealed class NumberGroups : List<List<ValueCount>>, IList<List<ValueCount>>, ICollection<List<ValueCount>>, IReadOnlyList<List<ValueCount>>, IReadOnlyCollection<List<ValueCount>>, IEnumerable<List<ValueCount>>, IList, ICollection, IEnumerable
Inheritance
object
List<List<ValueCount>>
NumberGroups
Implements
IList<List<ValueCount>>
ICollection<List<ValueCount>>
IReadOnlyList<List<ValueCount>>
IReadOnlyCollection<List<ValueCount>>
IEnumerable<List<ValueCount>>
IList
ICollection
IEnumerable
Inherited Members
 List<List<ValueCount>>.Add(List<ValueCount>)
 List<List<ValueCount>>.AddRange(IEnumerable<List<ValueCount>>)
 List<List<ValueCount>>.AsReadOnly()
 List<List<ValueCount>>.BinarySearch(List<ValueCount>)
 List<List<ValueCount>>.BinarySearch(List<ValueCount>, IComparer<List<ValueCount>>)
 List<List<ValueCount>>.BinarySearch(int, int, List<ValueCount>, IComparer<List<ValueCount>>)
 List<List<ValueCount>>.Clear()
 List<List<ValueCount>>.Contains(List<ValueCount>)
 List<List<ValueCount>>.ConvertAll<TOutput>(Converter<List<ValueCount>, TOutput>)
 List<List<ValueCount>>.CopyTo(List<ValueCount>[])
 List<List<ValueCount>>.CopyTo(List<ValueCount>[], int)
 List<List<ValueCount>>.CopyTo(int, List<ValueCount>[], int, int)
 List<List<ValueCount>>.Exists(Predicate<List<ValueCount>>)
 List<List<ValueCount>>.Find(Predicate<List<ValueCount>>)
 List<List<ValueCount>>.FindAll(Predicate<List<ValueCount>>)
 List<List<ValueCount>>.FindIndex(int, int, Predicate<List<ValueCount>>)
 List<List<ValueCount>>.FindIndex(int, Predicate<List<ValueCount>>)
 List<List<ValueCount>>.FindIndex(Predicate<List<ValueCount>>)
 List<List<ValueCount>>.FindLast(Predicate<List<ValueCount>>)
 List<List<ValueCount>>.FindLastIndex(int, int, Predicate<List<ValueCount>>)
 List<List<ValueCount>>.FindLastIndex(int, Predicate<List<ValueCount>>)
 List<List<ValueCount>>.FindLastIndex(Predicate<List<ValueCount>>)
 List<List<ValueCount>>.ForEach(Action<List<ValueCount>>)
 List<List<ValueCount>>.GetEnumerator()
 List<List<ValueCount>>.GetRange(int, int)
 List<List<ValueCount>>.IndexOf(List<ValueCount>)
 List<List<ValueCount>>.IndexOf(List<ValueCount>, int)
 List<List<ValueCount>>.IndexOf(List<ValueCount>, int, int)
 List<List<ValueCount>>.Insert(int, List<ValueCount>)
 List<List<ValueCount>>.InsertRange(int, IEnumerable<List<ValueCount>>)
 List<List<ValueCount>>.LastIndexOf(List<ValueCount>)
 List<List<ValueCount>>.LastIndexOf(List<ValueCount>, int)
 List<List<ValueCount>>.LastIndexOf(List<ValueCount>, int, int)
 List<List<ValueCount>>.Remove(List<ValueCount>)
 List<List<ValueCount>>.RemoveAll(Predicate<List<ValueCount>>)
 List<List<ValueCount>>.RemoveAt(int)
 List<List<ValueCount>>.RemoveRange(int, int)
 List<List<ValueCount>>.Reverse()
 List<List<ValueCount>>.Reverse(int, int)
 List<List<ValueCount>>.Sort()
 List<List<ValueCount>>.Sort(IComparer<List<ValueCount>>)
 List<List<ValueCount>>.Sort(Comparison<List<ValueCount>>)
 List<List<ValueCount>>.Sort(int, int, IComparer<List<ValueCount>>)
 List<List<ValueCount>>.ToArray()
 List<List<ValueCount>>.TrimExcess()
 List<List<ValueCount>>.TrueForAll(Predicate<List<ValueCount>>)
 List<List<ValueCount>>.Capacity
 List<List<ValueCount>>.Count
 List<List<ValueCount>>.this[int]
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.ReferenceEquals(object, object)
 object.ToString()
Methods
 Create(IEnumerable<double>)
Creates new instance with one group with specified sequence of numbers.
public static NumberGroups Create(IEnumerable<double> positions)
Parameters
positions IEnumerable<double>
The sequence of numbers to add to group.
Returns
NumberGroups
A new instance of group.
 Create(List<ValueCount>)
Creates new instance with list of ValueCount .
public static NumberGroups Create(List<ValueCount> list)
Parameters
list List<ValueCount>
The list of ValueCount objects.
Returns
NumberGroups
A new instance of group.
 Create(double)
Creates new instance with one group with one value.
public static NumberGroups Create(double value)
Parameters
value double
The value to set to group.
Returns
NumberGroups
A new instance of group.
 Create(double, int)
Creates a new instance of one group with several values (defined by count).
public static NumberGroups Create(double value, int count)
Parameters
value double
The input value.
count int
The count, defined value repeating.
Returns
NumberGroups
A new instance of group.
 Create(params double[])
Creates new instance with one group with specified sequence of numbers.
public static NumberGroups Create(params double[] positions)
Parameters
positions double[]
The sequence of numbers to add to group.
Returns
NumberGroups
A new instance of group.
 Create(params string[])
Creates new instance with varibale count of bolts based on * operator
public static NumberGroups Create(params string[] positions)
Parameters
positions string[]
Returns
NumberGroups
 CreateGroups(IEnumerable<double>)
Creates new instance with groups with with one value in group.
public static NumberGroups CreateGroups(IEnumerable<double> positions)
Parameters
positions IEnumerable<double>
The sequence of numbers to create groups.
Returns
NumberGroups
A new instance of groups.
 CreateGroups(params double[])
Creates new instance with groups with with one value in group.
public static NumberGroups CreateGroups(params double[] positions)
Parameters
positions double[]
The sequence of numbers to create groups.
Returns
NumberGroups
A new instance of groups.
 Edit this page